from functools import reduce
n = {} # для сравнения новостей
n['Курс биткоина вырос до 1000 долларов'] = 5
n['В новогоднюю ночь выйдет новая первая серия нового сезона "Шерлока"'] = 10
n['В Новосибирске из автобуса сбежала кондуктор'] = 7
n['Самолет «Почты России» вылетел с опозданием в несколько месяцев'] = 1
n['Козёл Тимур подружился с тигром Амуром'] = 20
n['Инженерам из Space X удалось посадить первую ступень ракеты на землю'] = 10

ne = {} # печать новостей
ne1 = "Курс биткоина вырос до 1000 долларов"
ne2 = "В новогоднюю ночь выйдет новая первая серия нового сезона Шерлока"
ne3 = "В Новосибирске из автобуса сбежала кондуктор"
ne4 = "Самолет «Почты России» вылетел с опозданием в несколько месяцев"
ne5 = "Козёл Тимур подружился с тигром Амуром"
ne6 = "Инженерам из Space X удалось посадить первую ступень ракеты на землю"

print(ne1)

def new(a, b, d):
    print(d if (a < b) else '...')
    #r =  map(lambda a, b, d: d if(a < b) else "...", new) map еще порабоотать
    #r =  reduce(lambda a, b, d: d if(a < b) else "...", new) нет так как a не меняется
    # как их объединить не знаю
    #print(r)
new(n['Курс биткоина вырос до 1000 долларов'], n['В новогоднюю ночь выйдет новая первая серия нового сезона "Шерлока"'], ne2)
new(n['В новогоднюю ночь выйдет новая первая серия нового сезона "Шерлока"'], n['В Новосибирске из автобуса сбежала кондуктор'], ne3)
new(n['В Новосибирске из автобуса сбежала кондуктор'], n['Самолет «Почты России» вылетел с опозданием в несколько месяцев'], ne4)
new(n['Самолет «Почты России» вылетел с опозданием в несколько месяцев'], n['Козёл Тимур подружился с тигром Амуром'], ne5)
new(n['Козёл Тимур подружился с тигром Амуром'], n['Инженерам из Space X удалось посадить первую ступень ракеты на землю'], ne6)