def n1():
    s = 0 #количество слов
    d=[] #список слов
    while s >= 0: #надо
        word = input("введите слово: ") #слова
        if word == "stop": #чтобы остановить цикл
            break #стоп
        s += 1 #+ слово
        d += word.split() #лист слов в строчку
        continue #дальше
    print(*d)

def n2():
    import random
    s = 3  # количество жизней
    r = 0  # количество ответов
    while s >= 0:  # так лень по условию
        if s == 0:  # это так для того кто проиграл чтобы красиво было
            print(f"у вас ноль жизней вы проиграли. Правильных ответов {r}")
            break
        a = random.randint(0, 10)  # рандом точка орг
        b = random.randint(0, 10)  # рандом точка орг
        it = a + b  # не ну это надо считать по калькулятору
        ui = int(input(f"У вас осталось {s} жизней. Сколько будет {a} + {b} = "))  # писать тут свой ответ
        if it == ui:  # ну сравнить надо с калькулятором
            r += 1  # +балл когда правильно
            print(f"Ответ правильный у вас {s} жизней")  # красиво написал
        else:
            s -= 1  # ахахах ля как это не решить
            print("Ответ не вырный у вас - 1 жизнь")  # как сказал не ну хорош
        continue
def n3():
    s = 0  # количество слов всех
    r = 0  # количество редких слов
    while s >= 0:  # лень думать
        a = input("Введите слово если не хотите ввоодить слово то напишите stop: ")  # чек слова в сумочке
        sg = "ф"
        if a == "stop":  # лень чекать
            print(f"Спасибо за запуск проги слов введин {s} редки слов введино {r}")  # когда лень чекать
            break
        if sg in a:  # чек на редкость
            r += 1  # + к редкому слову
            s += 1  # + к слову
            print("Это слово редкое")  # когда редкое
        else:
            s += 1  # + к слову
            print("Это слово не редкое")  # когда обычное
            continue

n1()
n2()
n3()
